/*******************************EMC测试***************************************/
/*1. 当进行EMC认证时,放开下面的宏定义 2. 不进行EMC认证时,屏蔽下面的宏定义*/
//#define EMC_Test
/*******************************EMC测试***************************************/

/*******************************ce专标，80601-2-56测试***************************************/
/*1. 当进行EMC认证时,放开下面的宏定义 2. 不进行EMC认证时,屏蔽下面的宏定义*/
#define CE_Tset_80601_2_56

/*******************************屏幕文件***************************************/
/*不同型号屏幕文件选择:宏定义只能单选！！！*/
/*适用DMT-4718/19/20*/
//#define LCD_4718
/*适用DMT-4726*/
//#define LCD_4726
/*适用DMT-4726高精度*/
//#define LCD_4726TC								
/*适用DMT-4735/60/63/65/73/75/79系列*/
#define LCD_4718
/*******************************屏幕文件***************************************/
 

/**************************************************************程序编码**********************************************************************/
/*切换程序编码时需先确认定义的屏幕文件！！防止显示乱码！！*/	
#define Soft_Code							426
/**************************************************************程序编码**********************************************************************/
#define Enable								1
#define Disable								0

/*DMT-4718p:426*/
#if Soft_Code == 426
/*******************************程序版本***************************************/
#define Soft_Internal_Version 		10 	  /*对内程序版本*/
#define Soft_External_Version 	   10 	/*对外程序版本(不可轻易修改)*/
/*******************************程序版本***************************************/


/***********************电池符号分段显示**************************/
/*电池符号分段显示，MDR新规适用*/
	/*目前有 Enable/Disable 可选*/
	#define Bat_4718_MDR							Enable
/***********************电池符号分段显示**************************/


/***********************预设测量时间/s(特规品预留)**************************/
	/*测量时间/s(特规品预留)*/
	/*适用范围:仅适用于实测算法,预测算法无预设时间*/
	#define MeasureTime		 	 			0
/***********************预设测量时间/s(特规品预留)**************************/


/************预设摄氏度华氏度特性是短路可选或是不可选*****************/
	/*预设温度单位特性是否可选*/
	/*可选特性有如下四种:*/
	/*1.摄氏度优先,可切换:			Centigrade	CentigradeFirst_Switchable*/
	/*2.摄氏度优先,不可切换:		 Centigrade	 CentigradeFirst_NonSwitchable*/
	/*3.华氏度优先,可切换:			Fahrenheit	FahrenheitFirst_Switchable*/
	/*4.华氏度优先,不可切换:		 Fahrenheit	 FahrenheitFirst_NonSwitchable*/
	/*若短路可选功能打开,温度单位特性可根据I/O口属性进行如上选择,此时不关心TempUnitSet、Binding_StatusSet的取值*/
	/*若短路可选功能关闭,温度单位特性仅能从上述四种特性中选择一种*/
	
	/*预设温度单位特性是否可选*/
	/*目前有Enable/Disable可选*/
	/*Enable:打开该功能*/
	/*Disable:关闭该功能*/
	#define TempUnitOptional		 	 Enable
	
	/*若短路可选功能关闭,温度单位特性仅能从上述四种特性中选择一种*/
	#define TempUnitSet				   	   Centigrade
	#define Binding_StatusSet			CentigradeFirst_Switchable	
/************预设摄氏度华氏度特性是短路可选或是不可选*****************/


/******************预设判稳时间是短路可选或是不可选**********************/
	/*预设判稳时间是否可选*/
	/*可选4s/8s/16s则Enable改功能,不可选则Disable该功能*/
	/*StableTimeSet预设的判稳时间仅在短路功能可选关闭时有效,短路可选功能时不关心StableTimeSet的取值*/
	/*目前有Enable/Disable可选*/
	/*Enable:打开该功能*/
	/*Disable:关闭该功能*/
	#define StableTimeOptional		 	Enable
	
	/*StableTimeSet预设的判稳时间仅在短路功能可选关闭时有效,短路可选功能时不关心StableTimeSet的取值*/
	#define StableTimeSet				   16
/******************预设判稳时间是短路可选或是不可选**********************/


/**************************最大值更新算法选择*******************************/
	/*预设最大值算法*/
	/*目前有两种算法可选*/
	/*二者择其一,只允许选择其中一种算法*/	
	
	/*1.1.预测结束即进行最大值更新*/
	// #define	Func_UpdateMaxImmediately				Disable
	/*1.2.预测结束3分钟后进行最大值更新*/
	// #define Func_UpdateMax3Min							Enable
/**************************最大值更新算法选择*******************************/


/***********************哭笑脸和FL功能(二者择其一)*************************/
	/*FL(Fever Line)和哭笑脸(Smile Cry)可选*/
	/*哭笑脸和FL功能二者择其一,只允许最多选择一种功能(允许都不选)*/
	
	/*预设FL(Fever Line)功能*/
	/*目前有Enable/Disable可选*/
	/*Enable:打开该功能*/
	/*Disable:关闭该功能*/
	#define		Func_FL				  		Enable
	
	/*预设哭笑脸(Smile Cry)功能*/
	/*目前有Enable/Disable可选*/
	/*Enable:打开该功能*/
	/*Disable:关闭该功能*/
	#define		Func_SC				  		Disable
/***********************哭笑脸和FL功能(二者择其一)*************************/


/***********************数据外部存储功能************************************/
	/*目前仅存储10组记忆数据,可更改,修改MemTempNum宏即可*/
	/*如果更改MemTempNum的取值需要测试*/
	/*目前有Enable/Disable可选*/
	/*Enable:打开该功能*/
	/*Disable:关闭该功能*/
	#define 	Func_E2						 Disable
	
	/*兼容功能*/
	/*兼容记忆温度数量,数量可更改*/
	/*MemTempNum的取值原则:1.可用RAM的大小;2.外部EEPROM可用的大小*/
	#define 	MemTempNum	 		   10
/***********************数据外部存储功能************************************/


/********************************蓝牙功能**************************************/
	/*预设蓝牙功能*/
	/*目前有Enable/Disable可选*/
	/*Enable:打开该功能*/
	/*Disable:关闭该功能*/
	#define		Func_BLE				  Disable
	/*蓝牙设备名*/
	#define 	Ble_Name		 		  0x1298
/********************************蓝牙功能**************************************/
	
	
/******************************界面跳转功能***********************************/	
	/*兼容体温计型号:2.预测型*/
	/*二者选其一(在预测型中只能选择一个小型号),不允许开启多个功能*/
	/*2.预测型,预测型目前分为两种,后面有特殊型号可扩充*/
	/*目前两种预测型型号:2.1.全显界面长按3s进入模式切换界面,最近一次温度界面长按3s进入温度单位切换界面,温度测量结束界面蜂鸣结束长按3s进入记忆温度界面*/
	/*目前两种预测型型号:2.2.全显界面长按3s进入温度单位切换界面,最近一次温度界面长按3s进入记忆温度界面,当前模式界面长按3s进入到模式切换界面*/
	
	
	/*2.1.全显界面长按3s进入模式切换界面,最近一次温度界面长按3s进入温度单位切换界面,温度测量结束界面蜂鸣结束长按3s进入记忆温度界面*/
	/*记忆温度界面由测量蜂鸣结束进入*/ 		/*全显界面、测温界面、测温结束界面短按关机*/			/*最近一次温度界面和当前模式界面短按无需关机*/
	/*目前有Enable/Disable可选*/
	/*Enable:打开该功能*/
	/*Disable:关闭该功能*/	
	#define Func_AllEntrModeExch_RecTempEntrUnitExch_MeasedTempEntrMem		Disable
	
	/*2.2.全显界面长按3s进入温度单位切换界面,最近一次温度界面长按3s进入记忆温度界面,当前模式界面长按3s进入到模式切换界面*/
	/*记忆温度界面由最近一次温度界面进入*/ /*全显界面、测温界面、测温结束界面短按关机*/
	/*目前有Enable/Disable可选*/
	/*Enable:打开该功能*/
	/*Disable:关闭该功能*/
	#define Func_AllEntrUnitExch_RecTempEntrMem_RecModeEntrModeExch				Enable
/******************************界面跳转功能***********************************/
	
	
/********************************背光功能**************************************/	
	/*兼容三种背光颜色,共计三种方案:1.单色;2.双色;3.三色*/
	/*三者者择其一或者都不选择(无背光),不允许开启多个功能*/
	
	/*预设单色背光功能*/
	/*目前有Enable/Disable可选*/
	/*Enable:打开该功能*/
	/*Disable:关闭该功能*/
	#define Func_SingleColor	   					Disable
	
	/*预设双色背光功能*/
	/*目前有Enable/Disable可选*/
	/*Enable:打开该功能*/
	/*Disable:关闭该功能*/
	#define	Func_DoubleColor					  Disable
	
	/*预设三色背光功能*/
	/*目前有Enable/Disable可选*/
	/*Enable:打开该功能*/
	/*Disable:关闭该功能*/
	#define Func_TribleColor					    Disable
	
	
	/*兼容测温结束背光时间,共计两种方案:1.亮10s;2.亮20s*/
	/*二者择其一,不允许开启多个功能,不允许不选*/
	/*当三种背光颜色方案都失能时,背光时间设置无效*/
	
	/*预设背光时间10s功能*/
	/*目前有Enable/Disable可选*/
	/*Enable:打开该功能*/
	/*Disable:关闭该功能*/
	#define Func_MeasuredTempBacklight10S	   					Enable
	
	/*预设背光时间20s功能*/
	/*目前有Enable/Disable可选*/
	/*Enable:打开该功能*/
	/*Disable:关闭该功能*/
	#define Func_MeasuredTempBacklight20S	   					Disable
/********************************背光功能**************************************/
	
	
/**************************测温界面背光功能**********************************/
	/*预设进入测温界面背光亮2S功能*/
	/*目前有Enable/Disable可选*/
	/*Enable:打开该功能*/
	/*Disable:关闭该功能*/
	#define Func_TempDetectingBacklight			Disable
/**************************测温界面背光功能**********************************/
	
/****************************温度间隔点***************************************/
	/*温度间隔点,分为三个点:1.高温/High分割点;2.发烧温度/Fever分割点;3.警告温度/Warn分割点;4.正常温/Normal度分割点;5.低温/Low分割点*/
	/*温度分割点温度可设,修改下方宏即可*/
	/*温度单位:℃*/
	/*1.高温/High分割点*/
	#define High_Temp_Centigrade					 4390
	/*2.发烧温度/Fever分割点*/
	#define Fever_Temp_Centigrade					3780
	/*3.警告温度/Warn分割点*/
	#define Warn_Temp_Centigrade		   			3730
	/*4.正常温度/Normal度分割点*/
	#define Noamal_Temp_Centigrade		 		  3580
	/*5.低温/Low分割点*/
	#define Low_Temp_Centigrade						 2600
	
	/*温度间隔点,分为三个点:1.高温/High分割点;2.发烧温度/Fever分割点;3.警告温度/Warn分割点;4.正常温/Normal度分割点;5.低温/Low分割点*/
	/*温度分割点温度可设,修改下方宏即可*/
	/*温度单位:℉*/
	/*1.高温/High分割点*/
	#define High_Temp_Fahrenheit			 		 11100
	/*2.发烧温度/Fever分割点*/
	#define Fever_Temp_Fahrenheit					10000
	/*3.警告温度/Warn分割点*/
	#define Warn_Temp_Fahrenheit		    		9910
	/*4.正常温度/Normal度分割点*/
	#define Noamal_Temp_Fahrenheit		  		  9640
	/*5.低温/Low分割点*/
	#define Low_Temp_Fahrenheit				 		 7880
/****************************温度间隔点***************************************/
#endif



